<a href="https://colab.research.google.com/github/Vikranttyagi95/Black_Friday_Sales_Prediction/blob/main/BlackFridaySales.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [143]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
from google.colab import files

In [ ]:
uploaded = files.upload()

Saving train.csv to train.csv

In [144]:
!ls

sample_data  train.csv

In [145]:
df = pd.read_csv('train.csv')

In [146]:
df.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN     8370
1  1000001  P00248942      F  ...                6.0                14.0    15200
2  1000001  P00087842      F  ...                NaN                 NaN     1422
3  1000001  P00085442      F  ...               14.0                 NaN     1057
4  1000002  P00285442      M  ...                NaN                 NaN     7969

[5 rows x 12 columns]

In [ ]:
df.describe().T

                       count          mean  ...        75%        max
User_ID             550068.0  1.003029e+06  ...  1004478.0  1006040.0
Occupation          550068.0  8.076707e+00  ...       14.0       20.0
Marital_Status      550068.0  4.096530e-01  ...        1.0        1.0
Product_Category_1  550068.0  5.404270e+00  ...        8.0       20.0
Product_Category_2  376430.0  9.842329e+00  ...       15.0       18.0
Product_Category_3  166821.0  1.266824e+01  ...       16.0       18.0
Purchase            550068.0  9.263969e+03  ...    12054.0    23961.0

[7 rows x 8 columns]

In [147]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category_1          550068 non-null  int64
 9   Product_Category_2          376430 non-null  float64
 10  Product_Category_3          166821 non-null  float64
 11  Purchase                    550068 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [148]:
df1 = df.copy()

In [149]:
df1.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN     8370
1  1000001  P00248942      F  ...                6.0                14.0    15200
2  1000001  P00087842      F  ...                NaN                 NaN     1422
3  1000001  P00085442      F  ...               14.0                 NaN     1057
4  1000002  P00285442      M  ...                NaN                 NaN     7969

[5 rows x 12 columns]

In [152]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy='median')

In [194]:
Y = df1['Purchase']

In [202]:
del df1['Product_ID']

In [203]:
df1.head()

   User_ID Gender  ... Product_Category_2  Product_Category_3
0  1000001      F  ...                NaN                 NaN
1  1000001      F  ...                6.0                14.0
2  1000001      F  ...                NaN                 NaN
3  1000001      F  ...               14.0                 NaN
4  1000002      M  ...                NaN                 NaN

[5 rows x 10 columns]

In [162]:
df1_num = df1[['Product_Category_1','Product_Category_2','Product_Category_3']]

In [163]:
imputer.fit(df1_num)

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='median', verbose=0)

In [198]:
imputer.statistics_

array([ 5.,  9., 14.])

In [165]:
X = imputer.transform(df1_num)

In [199]:
df1_num.head()

   Product_Category_1  Product_Category_2  Product_Category_3
0                   3                 NaN                 NaN
1                   1                 6.0                14.0
2                  12                 NaN                 NaN
3                  12                14.0                 NaN
4                   8                 NaN                 NaN

In [168]:
df1_num_tr = pd.DataFrame(X, columns=df1_num.columns, index=df1_num.index)

In [173]:
df1_num_tr.head()

   Product_Category_1  Product_Category_2  Product_Category_3
0                 3.0                 9.0                14.0
1                 1.0                 6.0                14.0
2                12.0                 9.0                14.0
3                12.0                14.0                14.0
4                 8.0                 9.0                14.0

In [177]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder()
df1_age = df1[['Age']]
df1_age = ohe.fit_transform(df1_age)

In [175]:
ohe.categories_

[array(['0-17', '18-25', '26-35', '36-45', '46-50', '51-55', '55+'],
       dtype=object)]

In [204]:
df1.head()

   User_ID Gender  ... Product_Category_2  Product_Category_3
0  1000001      F  ...                NaN                 NaN
1  1000001      F  ...                6.0                14.0
2  1000001      F  ...                NaN                 NaN
3  1000001      F  ...               14.0                 NaN
4  1000002      M  ...                NaN                 NaN

[5 rows x 10 columns]

In [188]:
from sklearn.compose import ColumnTransformer
num_attributes = list(df1_num)
cat_attributes = ['Gender','Age','City_Category','Stay_In_Current_City_Years']

full_pipeline = ColumnTransformer([
                                   ("num", SimpleImputer(strategy='median'), num_attributes),
                                   ("cat", OneHotEncoder(), cat_attributes)
])

In [205]:
df1_prepared = full_pipeline.fit_transform(df1)

In [207]:
df1_prepared.shape

(550068, 20)

In [208]:
Y = Y.to_numpy()

In [209]:
Y.shape

(550068,)

In [210]:
from sklearn.ensemble import RandomForestRegressor

rf_reg = RandomForestRegressor(n_estimators=100,criterion='mse',random_state=42)
rf_reg.fit(df1_prepared, Y)

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=100, n_jobs=None, oob_score=False,
                      random_state=42, verbose=0, warm_start=False)

In [211]:
predictions = rf_reg.predict(df1_prepared)

In [213]:
from sklearn.metrics import mean_squared_error

lin_mse = mean_squared_error(Y, predictions)

In [214]:
lin_mse = np.sqrt(lin_mse)
print(lin_mse)

2807.499307956352

In [215]:
!ls

sample_data  train.csv

In [216]:
uploaded = files.upload()

Saving test.csv to test.csv

In [217]:
!ls

sample_data  test.csv  train.csv

In [218]:
X_test = pd.read_csv('test.csv')

In [219]:
X_test.head()

   User_ID Product_ID  ... Product_Category_2 Product_Category_3
0  1000004  P00128942  ...               11.0                NaN
1  1000009  P00113442  ...                5.0                NaN
2  1000010  P00288442  ...               14.0                NaN
3  1000010  P00145342  ...                9.0                NaN
4  1000011  P00053842  ...                5.0               12.0

[5 rows x 11 columns]

In [224]:
del X_test['Product_ID']

In [225]:
X_test.head()

   User_ID Gender  ... Product_Category_2  Product_Category_3
0  1000004      M  ...               11.0                 NaN
1  1000009      M  ...                5.0                 NaN
2  1000010      F  ...               14.0                 NaN
3  1000010      F  ...                9.0                 NaN
4  1000011      F  ...                5.0                12.0

[5 rows x 10 columns]

In [227]:
X_test_prepared = full_pipeline.fit_transform(X_test)

In [228]:
test_pred = rf_reg.predict(X_test_prepared)

In [229]:
test_pred

array([14963.59170632, 10198.87360024,  6391.92585338, ...,
        9277.04953846, 20922.57      ,  1983.11961643])

In [230]:
X_test_final = pd.read_csv('test.csv')

In [231]:
X_test_final.head()

   User_ID Product_ID  ... Product_Category_2 Product_Category_3
0  1000004  P00128942  ...               11.0                NaN
1  1000009  P00113442  ...                5.0                NaN
2  1000010  P00288442  ...               14.0                NaN
3  1000010  P00145342  ...                9.0                NaN
4  1000011  P00053842  ...                5.0               12.0

[5 rows x 11 columns]

In [232]:
test_pred2 = test_pred

In [234]:
test_pred2 = test_pred2.tolist()

In [235]:
X_test_final['Purchase'] = test_pred2

In [239]:
X_test_final.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000004  P00128942      M  ...               11.0                 NaN  14964.0
1  1000009  P00113442      M  ...                5.0                 NaN  10199.0
2  1000010  P00288442      F  ...               14.0                 NaN   6392.0
3  1000010  P00145342      F  ...                9.0                 NaN   2921.0
4  1000011  P00053842      F  ...                5.0                12.0   2904.0

[5 rows x 12 columns]

In [238]:
X_test_final['Purchase'] = round(X_test_final['Purchase'])

In [240]:
X_test_final = X_test_final[['Purchase','User_ID','Product_ID']]

In [241]:
X_test_final.head()

   Purchase  User_ID Product_ID
0   14964.0  1000004  P00128942
1   10199.0  1000009  P00113442
2    6392.0  1000010  P00288442
3    2921.0  1000010  P00145342
4    2904.0  1000011  P00053842

In [243]:
X_test_final.to_csv('MySubmission.csv', index=False)

In [248]:
predictions = predictions.tolist()

In [249]:
df['Prediced_Purchase'] = predictions

In [252]:
df['Prediced_Purchase'] = round(df['Prediced_Purchase'])

In [253]:
df.head(20)

    User_ID Product_ID Gender  ... Product_Category_3  Purchase Prediced_Purchase
0   1000001  P00069042      F  ...                NaN      8370           11376.0
1   1000001  P00248942      F  ...               14.0     15200           16887.0
2   1000001  P00087842      F  ...                NaN      1422            1558.0
3   1000001  P00085442      F  ...                NaN      1057            1215.0
4   1000002  P00285442      M  ...                NaN      7969            8033.0
5   1000003  P00193542      M  ...                NaN     15227           14067.0
6   1000004  P00184942      M  ...               17.0     19215           16910.0
7   1000004  P00346142      M  ...                NaN     15854           12736.0
8   1000004   P0097242      M  ...                NaN     15686           15619.0
9   1000005  P00274942      M  ...                NaN      7871            7234.0
10  1000005  P00251242      M  ...                NaN      5254            5784.0
11  1000005  P00014542      M  ...                NaN      3957            7234.0
12  1000005  P00031342      M  ...                NaN      6073            7234.0
13  1000005  P00145042      M  ...                5.0     15665           13268.0
14  1000006  P00231342      F  ...               14.0      5378            6231.0
15  1000006  P00190242      F  ...                NaN      2079            2246.0
16  1000006   P0096642      F  ...                4.0     13055           12446.0
17  1000006  P00058442      F  ...                NaN      8851            6617.0
18  1000007  P00036842      M  ...               16.0     11788           13903.0
19  1000008  P00249542      M  ...               15.0     19614           12296.0

[20 rows x 13 columns]